In [2]:
import numpy as np
import pandas as pd

## create a Dataframe

In [4]:
data={
    'Name':['Akhil','sahil','Warish','Aman'],
    'Age':[21,23,24,18],
    'City':['Kannauj','Abohar','Mau','Kannauj'],
    'salary':[40000,45000,30000,25000]
}

In [10]:
df1=pd.DataFrame(data)

In [11]:
df

     Name  Age     City  salary
0   Akhil   21  Kannauj   40000
1   sahil   23   Abohar   45000
2  Warish   24      Mau   30000
3    Aman   18  Kannauj   25000

In [3]:
data_list=[
    ['Akhil',21,'Kannauj',40000],
    ['sahil',23,'Abohar',45000],
    ['Warish',24,'Mau',45000],
    ['Aman',18,'Kannauj',25000]
]
columns=['Name','Age','City','Salary']

In [4]:
df2=pd.DataFrame(data_list)

In [11]:
df2=pd.DataFrame(data_list,columns=columns)

In [27]:
df2

     Name  Age     City  Salary
0   Akhil   21  Kannauj   40000
1   sahil   23   Abohar   45000
2  Warish   24      Mau   45000
3    Aman   18  Kannauj   25000

## Selection and Indexing of Columns

In [28]:
df2['Name']

0     Akhil
1     sahil
2    Warish
3      Aman
Name: Name, dtype: object

In [29]:
df2[['Name','City']]

     Name     City
0   Akhil  Kannauj
1   sahil   Abohar
2  Warish      Mau
3    Aman  Kannauj

## Creating a columns

In [30]:
df2['Designation']=['Software Developer','Front-end Developer','Back-end Developer','Doctor']

In [31]:
df2

     Name  Age     City  Salary          Designation
0   Akhil   21  Kannauj   40000   Software Developer
1   sahil   23   Abohar   45000  Front-end Developer
2  Warish   24      Mau   45000   Back-end Developer
3    Aman   18  Kannauj   25000               Doctor

## Removing or Dropping columns

In [33]:
df2.drop('Designation',axis=1)

     Name  Age     City  Salary
0   Akhil   21  Kannauj   40000
1   sahil   23   Abohar   45000
2  Warish   24      Mau   45000
3    Aman   18  Kannauj   25000

In [34]:
df2

     Name  Age     City  Salary          Designation
0   Akhil   21  Kannauj   40000   Software Developer
1   sahil   23   Abohar   45000  Front-end Developer
2  Warish   24      Mau   45000   Back-end Developer
3    Aman   18  Kannauj   25000               Doctor

In [35]:
df2.drop('Designation',axis=1,inplace=True)

In [36]:
df2

     Name  Age     City  Salary
0   Akhil   21  Kannauj   40000
1   sahil   23   Abohar   45000
2  Warish   24      Mau   45000
3    Aman   18  Kannauj   25000

In [37]:
df2.drop(['Age','City'],axis=1)

     Name  Salary
0   Akhil   40000
1   sahil   45000
2  Warish   45000
3    Aman   25000

In [38]:
## Removing Row
df2.drop(3,axis=0)

     Name  Age     City  Salary
0   Akhil   21  Kannauj   40000
1   sahil   23   Abohar   45000
2  Warish   24      Mau   45000

### Selecting Rows

In [6]:
df2.loc[[0,1]]

       0   1        2      3
0  Akhil  21  Kannauj  40000
1  sahil  23   Abohar  45000

In [8]:
df2.iloc[0]

0      Akhil
1         21
2    Kannauj
3      40000
Name: 0, dtype: object

### Selecting Subsets of rows and Columns

In [13]:
df2

     Name  Age     City  Salary
0   Akhil   21  Kannauj   40000
1   sahil   23   Abohar   45000
2  Warish   24      Mau   45000
3    Aman   18  Kannauj   25000

In [12]:
df2.loc[[0,1]][['City','Salary']]

      City  Salary
0  Kannauj   40000
1   Abohar   45000

In [15]:
df2.loc[[2,3]][['Name','Age']]

     Name  Age
2  Warish   24
3    Aman   18

### Conditional Selection

In [16]:
df2

     Name  Age     City  Salary
0   Akhil   21  Kannauj   40000
1   sahil   23   Abohar   45000
2  Warish   24      Mau   45000
3    Aman   18  Kannauj   25000

In [17]:
# I only want to see those people whose age is above 22

In [20]:
df2[df2['Age']>22]

     Name  Age    City  Salary
1   sahil   23  Abohar   45000
2  Warish   24     Mau   45000

In [22]:
# city must be Abohar
df2[(df2['Age']>22) & (df2['City']=='Abohar')]

    Name  Age    City  Salary
1  sahil   23  Abohar   45000